# Parameters
nc: 1 # number of classes
kpt_shape: [21, 3]
scales: # model compound scaling constants.
  # [depth, width, max_channels]
  w32: [1.0, 1.0, 1024] # Just a super large model.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, C3k2, [64, False, 0.5]]
  - [-1, 1, Conv, [64, 3, 2]] # 2-P2/4
  - [-1, 1, C3k2, [128, False, 0.5]]
  - [-1, 1, Conv, [128, 3, 2]] # 4-P3/8
  - [-1, 2, A2C2f,[128, False, -1]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P4/16
  - [-1, 2, A2C2f,[256, False, -1]]

head:
  #  [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 8-P3/8
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3/8
  - [-1, 1, A2C2f,[128, False, -1]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11-P2/4
  - [[-1, 3], 1, Concat, [1]] # cat backbone P2/4
  - [-1, 1, A2C2f, [64, False, 1]]

  - [-1, 1, HREncoder, [1]] # 14

  - [-1, 1, HRBlock, [[32,64],[2,2]]] # 15-P3/8
  - [-1, 3, HRBlock, [[32,64,128],[2,2,2]]] # 16-P4/16
  - [-1, 2, HRBlock, [[32,64,128,256],[2,2,2,2]]] # 17-P5/32

  - [-1, 1, HRDecoder, [[128,256,512,512]]] # 18-P2/4

  - [[-1], 1, Pose, [nc, kpt_shape]] # 19-Detect
