# Parameters
nc: 80 # number of classes
kpt_shape: [21, 3]
scales: # model compound scaling constants.
  # [depth, width, max_channels]
  w18v2: [1.0, 1.0, 1024] # Just a super large model.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 2, C3k2, [32, False, 0.25]]
  - [-1, 1, Conv, [64, 3, 2]] # 2-P2/4
  - [-1, 2, C3k2, [64, False, 0.25]]
  - [-1, 2, A2C2f, [64, False, -1]]
  - [-1, 1, Conv, [128, 3, 2]] # 5-P3/8
  - [-1, 2, C3k2, [128, False, 0.25]]
  - [-1, 1, A2C2f, [128, False, -1]] # 7

head:
  #  [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P2/4
  - [-1, 1, A2C2f, [64, False, 1]] # 10
  
  - [-1, 1, HRBlock, [[18,36],[2,2],False]]
  - [-1, 3, HRBlock, [[18,36,72],[2,2,2],False]]
  - [-1, 2, HRBlock, [[18,36,72,144],[2,2,2,2],False]] # 13

  - [11, 1, HRDecoder, [1024,[18,36]]] # 14
  - [-1, 1, A2C2f, [64, False, 1]]
  - [12, 1, HRDecoder, [1024,[18,36,72]]] # 16
  - [-1, 1, A2C2f, [128, False, -1]]
  - [13, 1, HRDecoder, [1024,[18,32,72,144]]] # 18
  - [-1, 1, A2C2f, [256, False, -1]]

  - [[15,17,19], 1, Pose, [nc, kpt_shape]] # 20-Detect
