# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants.
  # [depth, width, max_channels]
  w18v2: [1.0, 1.0, 512] # Just a super large model.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4
  - [-1, 1, C3k2, [128, False, 0.25]]
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 1, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16
  - [-1, 2, A2C2f, [256, True, 1]]
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 2, A2C2f, [512, True, 4]] # 8

head:
  #  [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3/8
  - [-1, 1, A2C2f, [256, False, 1]] # 11-P3/8
  
  - [-1, 1, HRBlock, [[18,36],[2,2],False]]
  - [-1, 3, HRBlock, [[18,36,72],[2,2,2],False]]
  - [-1, 2, HRBlock, [[18,36,72,144],[2,2,2,2],False]]

  - [-1, 1, HRDecoder, [1024,[18,36,72,144]]] # 15

  - [[-1], 1, Detect, [nc]] # Detect
